aroyer-qc/STM32F7_FatFS_HAL_Free/source/FatFs/fatfs_sd_sdio.c
// Following commands are SD Card Specific commands.
// SDMMC_APP_CMD should be sent before sending these commands.
#define SD_CMD_APP_SD_SET_BUSWIDTH      ((uint8_t)6)   // (ACMD6) Defines the data bus width to be used for data transfer. The allowed data bus
                                                       // widths are given in SCR register.
#define SD_CMD_SD_APP_STATUS            ((uint8_t)13)  // (ACMD13) Sends the SD status.
#define SD_CMD_SD_APP_OP_COND           ((uint8_t)41)  // (ACMD41) Sends host capacity support information (HCS) and asks the accessed card to
                                                       // send its operating condition register (OCR) content in the response on the CMD line.
#define SD_CMD_SD_APP_SEND_SCR          ((uint8_t)51)  // Reads the SD Configuration Register (SCR).



/* Typedef(s) -------------------------------------------------------------------------------------------------------*/

typedef enum
{
    HAL_OK       = 0x00,
    HAL_ERROR    = 0x01,
    HAL_BUSY     = 0x02,
    HAL_TIMEOUT  = 0x03
} Status_t;


typedef enum
{
    SD_SINGLE_BLOCK    = 0,       // Single block operation
    SD_MULTIPLE_BLOCK  = 1,       // Multiple blocks operation
} SD_Operation_t;


typedef struct
{
    uint32_t                     CardType;         // SD card type
    uint32_t                     RCA;              // SD relative card address
    uint32_t                     CSD[4];           // SD card specific data table
    uint32_t                     CID[4];           // SD card identification number table
    volatile uint32_t            TransferComplete; // SD transfer complete flag in non blocking mode
    volatile uint32_t            TransferError;    // SD transfer error flag in non blocking mode
    volatile uint32_t            DMA_XferComplete; // SD DMA transfer complete flag
    volatile uint32_t            Operation;      // SD transfer operation (read/write)
} SD_Handle_t;


typedef struct
{
    uint8_t  CSDStruct;            // CSD structure
    uint8_t  SysSpecVersion;       // System specification version
    uint8_t  Reserved1;            // Reserved
    uint8_t  TAAC;                 // Data read access time 1
    uint8_t  NSAC;                 // Data read access time 2 in CLK cycles
    uint8_t  MaxBusClkFrec;        // Max. bus clock frequency
    uint16_t CardComdClasses;      // Card command classes
    uint8_t  RdBlockLen;           // Max. read data block length
    uint8_t  PartBlockRead;        // Partial blocks for read allowed
    uint8_t  WrBlockMisalign;      // Write block misalignment
    uint8_t  RdBlockMisalign;      // Read block misalignment
    uint8_t  DSRImpl;              // DSR implemented
    uint8_t  Reserved2;            // Reserved
    uint32_t DeviceSize;           // Device Size
    uint8_t  MaxRdCurrentVDDMin;   // Max. read current @ VDD min
    uint8_t  MaxRdCurrentVDDMax;   // Max. read current @ VDD max
    uint8_t  MaxWrCurrentVDDMin;   // Max. write current @ VDD min
    uint8_t  MaxWrCurrentVDDMax;   // Max. write current @ VDD max
    uint8_t  DeviceSizeMul;        // Device size multiplier
    uint8_t  EraseGrSize;          // Erase group size
    uint8_t  EraseGrMul;           // Erase group size multiplier
    uint8_t  WrProtectGrSize;      // Write protect group size
    uint8_t  WrProtectGrEnable;    // Write protect group enable
    uint8_t  ManDeflECC;           // Manufacturer default ECC
    uint8_t  WrSpeedFact;          // Write speed factor
    uint8_t  MaxWrBlockLen;        // Max. write data block length
    uint8_t  WriteBlockPaPartial;  // Partial blocks for write allowed
    uint8_t  Reserved3;            // Reserved
    uint8_t  ContentProtectAppli;  // Content protection application
    uint8_t  FileFormatGrouop;     // File format group
    uint8_t  CopyFlag;             // Copy flag (OTP)
    uint8_t  PermWrProtect;        // Permanent write protection
    uint8_t  TempWrProtect;        // Temporary write protection
    uint8_t  FileFormat;           // File format
    uint8_t  ECC;                  // ECC code
    uint8_t  CSD_CRC;              // CSD CRC
    uint8_t  Reserved4;            // Always 1
} SD_CSD_t;


typedef struct
{
    uint8_t  ManufacturerID;        // Manufacturer ID
    uint16_t OEM_AppliID;           // OEM/Application ID
    uint32_t ProdName1;             // Product Name part1
    uint8_t  ProdName2;             // Product Name part2
    uint8_t  ProdRev;               // Product Revision
    uint32_t ProdSN;                // Product Serial Number
    uint8_t  Reserved1;             // Reserved1
    uint16_t ManufactDate;          // Manufacturing Date
    uint8_t  CID_CRC;               // CID CRC
    uint8_t  Reserved2;             // Always 1

} SD_CID_t;


typedef struct
{
  volatile SD_CSD_t    SD_csd;         // SD card specific data register
  volatile SD_CID_t    SD_cid;         // SD card identification number register
  uint64_t             CardCapacity;   // Card capacity
  uint32_t             CardBlockSize;  // Card block size
  uint16_t             RCA;            // SD relative card address
  uint8_t              CardType;       // SD card type
} SD_CardInfo_t;


typedef enum
{
    SD_CARD_READY                  = ((uint32_t)0x00000001),  // Card state is ready
    SD_CARD_IDENTIFICATION         = ((uint32_t)0x00000002),  // Card is in identification state
    SD_CARD_STANDBY                = ((uint32_t)0x00000003),  // Card is in standby state
    SD_CARD_TRANSFER               = ((uint32_t)0x00000004),  // Card is in transfer state
    SD_CARD_SENDING                = ((uint32_t)0x00000005),  // Card is sending an operation
    SD_CARD_RECEIVING              = ((uint32_t)0x00000006),  // Card is receiving operation information
    SD_CARD_PROGRAMMING            = ((uint32_t)0x00000007),  // Card is in programming state
    SD_CARD_DISCONNECTED           = ((uint32_t)0x00000008),  // Card is disconnected
    SD_CARD_ERROR                  = ((uint32_t)0x000000FF)   // Card is in error state
} SD_CardState_t;

