aroyer-qc/STM32F7_FatFS_HAL_Free/source/FatFs/fatfs_sd_sdio.c
/* Variable(s) ------------------------------------------------------------------------------------------------------*/

static SD_Handle_t      SD_Handle;
static SD_CardInfo_t    SD_CardInfo;
static DSTATUS          Status;

/* Private function(s) ----------------------------------------------------------------------------------------------*/

static bool 	        SD_IsDetected               (void);
static void             SD_DataTransferInit         (uint32_t Size, uint32_t DataBlockSize, bool IsItReadFromCard);
static void             SD_TransmitCommand          (uint32_t Command, uint32_t Argument, uint8_t ResponseType);
static void             SD_GetResponse              (uint32_t* pResponse);
static void             SD_DMA_Complete             (DMA_Stream_TypeDef* pDMA_Stream);
static SD_Error_t       SD_InitializeCard           (void);
static uint8_t 	        SD_ReadBlocks_DMA           (uint32_t *pData, uint64_t ReadAddr, uint32_t BlockSize, uint32_t NumOfBlocks);
static uint8_t 	        SD_WriteBlocks_DMA          (uint32_t *pData, uint64_t WriteAddr, uint32_t BlockSize, uint32_t NumOfBlocks);
static SD_Error_t       SD_CheckWriteOperation      (void);
static SD_Error_t       SD_CheckReadOperation       (void);
static SD_Error_t       SD_Select_Deselect          (uint64_t addr);
static SD_Error_t       SD_PowerON                  (void);
static SD_Error_t       SD_SendStatus               (uint32_t *pCardStatus);
static SD_Error_t       SD_IsCardProgramming        (uint8_t *pStatus);
static SD_Error_t       SD_CmdError                 (void);
static SD_Error_t       SD_CmdResp1Error            (uint8_t SD_CMD);
static SD_Error_t       SD_CmdResp7Error            (void);
static SD_Error_t       SD_CmdResp3Error            (void);
static SD_Error_t       SD_CmdResp2Error            (void);
static SD_Error_t       SD_CmdResp6Error            (uint8_t SD_CMD, uint16_t *pRCA);
static SD_Error_t       SD_WideBusOperationConfig   (uint32_t WideMode);
static SD_Error_t       SD_StopTransfer             (void);
static SD_Error_t       SD_WideBusEnable            (void);
static SD_Error_t       SD_WideBusDisable           (void);
static SD_Error_t       SD_FindSCR                  (uint32_t *pSCR);

//static void             SD_PowerOFF                 (void);

/** -----------------------------------------------------------------------------------------------------------------*/
/**		SD_IsDetected
  *
  * @brief  Test if card is present
  * @param  bool   true or false
  */
static bool SD_IsDetected(void)
{
    return (IO_GetInputPinValue(SD_DETECT_GPIO_PORT, SD_DETECT_PIN) == 0);
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**		DataTransferInit
  *
  * @brief  Prepare the state machine for transfer
  * @param  SD_TransferType_e   TransfertDir
  * @param  SD_CARD_BlockSize_e Size
  */
static void SD_DataTransferInit(uint32_t Size, uint32_t DataBlockSize, bool IsItReadFromCard)
{
    uint32_t Direction;

    SDMMC1->DTIMER = SD_DATATIMEOUT;       // Set the SDMMC Data TimeOut value
    SDMMC1->DLEN   = Size;                  // Set the SDMMC DataLength value
    Direction      = (IsItReadFromCard == true) ? SDMMC_DCTRL_DTDIR : 0;
    //SDMMC1->DCTRL &= ~(uint32_t)DCTRL_CLEAR_MASK;
    SDMMC1->DCTRL |=  (uint32_t)(DataBlockSize | Direction | SDMMC_DCTRL_DTEN);
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**		SD_TransmitCommand
  *
  * @brief  Send the commande to SDMMC
  * @param  uint32_t Command
  * @param  uint32_t Argument              Must provide the response size
  * @param  uint8_t ResponseType
  */
static void SD_TransmitCommand(uint32_t Command, uint32_t Argument, uint8_t ResponseType)
{
    uint32_t Status;
    uint32_t Flag;

    // Clear the Command Flags
    SDMMC1->ICR = SDMMC_ICR_STATIC_FLAGS;

    // Send Command
    SDMMC1->ARG  = (uint32_t)Argument;                         // Set the SDMMC Argument value
   // SDMMC1->CMD &= (uint32_t)~CMD_CLEAR_MASK;                  // Reset parameters
    SDMMC1->CMD = (uint32_t)(Command | SDMMC_CMD_CPSMEN);     // Set SDMMC command parameters

/*
    m_TimeOut = SD_SOFTWARE_COMMAND_TIMEOUT;
    do
    {
        Status = SDMMC1->STA;
        if(m_TimeOut == 0) Status = SDMMC_STA_CTIMEOUT;
    }
    while((Status & (SDMMC_STA_CTIMEOUT | SDMMC_STA_CMDREND | SDMMC_STA_CCRCFAIL)) == 0);
        */
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**		GetResponse
  *
  * @brief  Get response from SD device
  * @param  uint32_t*       pResponse
  */
static void SD_GetResponse(uint32_t* pResponse)
{
    pResponse[0] = SDMMC1->RESP1;
    pResponse[1] = SDMMC1->RESP2;
    pResponse[2] = SDMMC1->RESP3;
    pResponse[3] = SDMMC1->RESP4;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  SD DMA transfer complete RX and TX callback.
  * @param  DMA_Stream_TypeDef* pDMA_Stream
  */
static void SD_DMA_Complete(DMA_Stream_TypeDef* pDMA_Stream)
{
    SD_Handle.DMA_XferComplete = 1;          // DMA transfer is complete
    while(SD_Handle.TransferComplete == 0){} // Wait until SD transfer is complete
    pDMA_Stream->CR &= ~DMA_SxCR_EN;         // Disable the stream
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Initializes all cards or single card as the case may be Card(s) come
  *         into standby state.
  * @retval SD Card error state
  */
static SD_Error_t SD_InitializeCard(void)
{
    SD_Error_t ErrorState = SD_OK;
    uint16_t sd_rca = 1;

    if((SDMMC1->POWER & SDMMC_POWER_PWRCTRL) == 0) // Power off
    {
        return SD_REQUEST_NOT_APPLICABLE;
    }

