aroyer-qc/STM32F7_FatFS_HAL_Free/source/FatFs/fatfs_sd_sdio.c
    if(SD_Handle.CardType != SECURE_DIGITAL_IO_CARD)
    {
        // Send CMD2 ALL_SEND_CID
         SD_TransmitCommand((SD_CMD_ALL_SEND_CID | SDMMC_CMD_RESPONSE_LONG), 0, 2);

        // Check for error conditions
        if((ErrorState = SD_CmdResp2Error()) != SD_OK)
        {
            return ErrorState;
        }

        // Get Card identification number data
        SD_GetResponse(SD_Handle.CID);
    }

    if((SD_Handle.CardType == STD_CAPACITY_SD_CARD_V1_1)    || (SD_Handle.CardType == STD_CAPACITY_SD_CARD_V2_0) ||
       (SD_Handle.CardType == SECURE_DIGITAL_IO_COMBO_CARD) || (SD_Handle.CardType == HIGH_CAPACITY_SD_CARD))
    {
        // Send CMD3 SET_REL_ADDR with argument 0
        // SD Card publishes its RCA.
       SD_TransmitCommand((SD_CMD_SET_REL_ADDR | SDMMC_CMD_RESPONSE_SHORT), 0, 6);

        // Check for error conditions
        if((ErrorState = SD_CmdResp6Error(SD_CMD_SET_REL_ADDR, &sd_rca)) != SD_OK)
        {
            return ErrorState;
        }
    }

    if(SD_Handle.CardType != SECURE_DIGITAL_IO_CARD)
    {
        // Get the SD card RCA
        SD_Handle.RCA = sd_rca;

        // Send CMD9 SEND_CSD with argument as card's RCA
        SD_TransmitCommand((SD_CMD_SEND_CSD | SDMMC_CMD_RESPONSE_LONG), SD_Handle.RCA << 16, 2);

        // Check for error conditions
        if((ErrorState = SD_CmdResp2Error()) == SD_OK)
        {
            // Get Card Specific Data
            SD_GetResponse(SD_Handle.CSD);
        }
    }

    // Card are initialized
    return ErrorState;
}

/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Reads block(s) from a specified address in a card. The Data transfer
  *         is managed by DMA mode.
  * @note   This API should be followed by the function SD_CheckReadOperation()
  *         to check the completion of the read process
  * @param  pReadBuffer: Pointer to the buffer that will contain the received data
  * @param  ReadAddr: Address from where data is to be read
  * @param  BlockSize: SD card Data block size
  * @note   BlockSize must be 512 bytes.
  * @param  NumberOfBlocks: Number of blocks to read.
  * @retval SD Card error state
  */
SD_Error_t SD_ReadBlocks_DMA(uint32_t *pReadBuffer, uint64_t ReadAddr, uint32_t BlockSize, uint32_t NumberOfBlocks)
{
    SD_Error_t ErrorState;
    uint32_t   CmdIndex;

    SDMMC1->DCTRL              = 0;                                                                 // Initialize data control register
    SD_Handle.TransferComplete = 0;                                                                 // Initialize handle flags
    SD_Handle.DMA_XferComplete = 0;
    SD_Handle.TransferError    = SD_OK;
    SD_Handle.Operation        = (NumberOfBlocks > 1) ? SD_MULTIPLE_BLOCK : SD_SINGLE_BLOCK;        // Initialize SD Read operation
    SDMMC1->MASK              |= (SDMMC_MASK_DCRCFAILIE | SDMMC_MASK_DTIMEOUTIE |                   // Enable transfer interrupts
                                  SDMMC_MASK_DATAENDIE  | SDMMC_MASK_RXOVERRIE);
    SDMMC1->DCTRL             |= SDMMC_DCTRL_DMAEN;                                                 // Enable SDMMC DMA transfer
    DMA2_Stream3->CR          &= ~DMA_SxCR_EN;                                                      // Disable the Peripheral
    DMA2_Stream3->NDTR         = (uint32_t)(BlockSize * NumberOfBlocks) / 4;                        // Configure DMA Stream data length
    DMA2_Stream3->M0AR         = (uint32_t)pReadBuffer;                                             // Configure DMA Stream destination address
    DMA2_Stream3->CR          |= DMA_SxCR_TCIE | DMA_SxCR_HTIE | DMA_SxCR_TEIE | DMA_SxCR_DMEIE;    // Enable all interrupts
    DMA2_Stream3->FCR         |= DMA_SxFCR_FEIE;
    DMA2_Stream3->CR          |= DMA_SxCR_EN;                                                       // Enable the Peripheral

    if(SD_Handle.CardType == HIGH_CAPACITY_SD_CARD)
    {
        BlockSize = 512;
        ReadAddr /= 512;
    }

    // Set Block Size for Card
    SD_TransmitCommand((SD_CMD_SET_BLOCKLEN | SDMMC_CMD_RESPONSE_SHORT), BlockSize, 1);
    if((ErrorState = SD_CmdResp1Error(SD_CMD_SET_BLOCKLEN)) != SD_OK)                               // Check for error conditions
    {
        return ErrorState;
    }

    // Configure the SD DPSM (Data Path State Machine)
    SD_DataTransferInit(BlockSize * NumberOfBlocks, SDMMC_DATABLOCK_SIZE_512B, true);

    // Send CMD18 READ_MULT_BLOCK with argument data address
    // or send CMD17 READ_SINGLE_BLOCK depending on number of block
    CmdIndex = (NumberOfBlocks > 1) ? SD_CMD_READ_MULT_BLOCK : SD_CMD_READ_SINGLE_BLOCK;

    SD_TransmitCommand((CmdIndex | SDMMC_CMD_RESPONSE_SHORT), (uint32_t)ReadAddr, 1);

    // Check for error conditions
    ErrorState = SD_CmdResp1Error((NumberOfBlocks > 1) ? SD_CMD_READ_MULT_BLOCK : SD_CMD_READ_SINGLE_BLOCK);

    // Update the SD transfer error in SD handle
    SD_Handle.TransferError = ErrorState;

    return ErrorState;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Writes block(s) to a specified address in a card. The Data transfer
  *         is managed by DMA mode.
  * @note   This API should be followed by the function HAL_SD_CheckWriteOperation()
  *         to check the completion of the write process (by SD current status polling).
  * @param  pWriteBuffer: pointer to the buffer that will contain the data to transmit
  * @param  WriteAddr: Address from where data is to be read
  * @param  BlockSize: the SD card Data block size
  * @note   BlockSize must be 512 bytes.
  * @param  NumberOfBlocks: Number of blocks to write
  * @retval SD Card error state
  */
SD_Error_t SD_WriteBlocks_DMA(uint32_t *pWriteBuffer, uint64_t WriteAddr, uint32_t BlockSize, uint32_t NumberOfBlocks)
{
    SD_Error_t ErrorState;
    uint32_t   CmdIndex;

