aroyer-qc/STM32F7_FatFS_HAL_Free/source/FatFs/fatfs_sd_sdio.c
    SDMMC1->DCTRL               = 0;                                                                // Initialize data control register
    SD_Handle.TransferComplete  = 0;                                                                // Initialize handle flags
    SD_Handle.DMA_XferComplete  = 0;
    SD_Handle.TransferError     = SD_OK;
    SD_Handle.Operation         = (NumberOfBlocks > 1) ? SD_MULTIPLE_BLOCK : SD_SINGLE_BLOCK;       // Initialize SD Write operation
    SDMMC1->MASK               |= (SDMMC_MASK_DCRCFAILIE | SDMMC_MASK_DTIMEOUTIE |                  // Enable transfer interrupts
                                   SDMMC_MASK_DATAENDIE  | SDMMC_MASK_TXUNDERRIE);
    SDMMC1->DCTRL              |= SDMMC_DCTRL_DMAEN;                                                // Enable SDMMC DMA transfer
    DMA2_Stream6->CR           &= ~DMA_SxCR_EN;                                                     // Disable the Peripheral
    DMA2_Stream6->NDTR          = (uint32_t)(BlockSize * NumberOfBlocks) / 4;                       // Configure DMA Stream data length
    DMA2_Stream6->M0AR          = (uint32_t)pWriteBuffer;                                           // Configure DMA Stream destination address
    DMA2_Stream6->CR           |= DMA_SxCR_TCIE | DMA_SxCR_HTIE | DMA_SxCR_TEIE | DMA_SxCR_DMEIE;   // Enable all interrupts
    DMA2_Stream6->FCR          |= DMA_SxFCR_FEIE;
    DMA2_Stream6->CR           |= DMA_SxCR_EN;                                                      // Enable the Peripheral

    if(SD_Handle.CardType == HIGH_CAPACITY_SD_CARD)
    {
        BlockSize  = 512;
        WriteAddr /= 512;
    }

    SD_TransmitCommand((SD_CMD_SET_BLOCKLEN | SDMMC_CMD_RESPONSE_SHORT), BlockSize, 1);

    if((ErrorState = SD_CmdResp1Error( SD_CMD_SET_BLOCKLEN)) != SD_OK)                              // Check for error conditions
    {
        return ErrorState;
    }

    // Check number of blocks command
    // Send CMD24 WRITE_SINGLE_BLOCK
    // Send CMD25 WRITE_MULT_BLOCK with argument data address
    CmdIndex = (NumberOfBlocks > 1) ? SD_CMD_WRITE_MULT_BLOCK : SD_CMD_WRITE_SINGLE_BLOCK;

    // Set Block Size for Card
     SD_TransmitCommand((CmdIndex | SDMMC_CMD_RESPONSE_SHORT), (uint32_t)WriteAddr, 1);

    // Check for error conditions
    if((SD_CmdResp1Error((NumberOfBlocks > 1) ? SD_CMD_WRITE_MULT_BLOCK : SD_CMD_WRITE_SINGLE_BLOCK)) != SD_OK)
    {
        return ErrorState;
    }

    // Configure the SD DPSM (Data Path State Machine)
    SD_DataTransferInit(BlockSize * NumberOfBlocks, SDMMC_DATABLOCK_SIZE_512B, false);

    SD_Handle.TransferError = ErrorState;

    return ErrorState;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  This function waits until the SD DMA data read transfer is finished.
  *         This API should be called after SD_ReadBlocks_DMA() function
  *         to insure that all data sent by the card is already transferred by the
  *         DMA controller.
  * @retval SD Card error state
  */
SD_Error_t SD_CheckReadOperation(void)
{
    SD_Error_t  ErrorState;
    uint32_t    TimeOut;
    uint32_t    tmp1;
    uint32_t    tmp2;
    SD_Error_t  tmp3;

    // Wait for DMA/SD transfer end or SD error variables to be in SD handle
    tmp1 = SD_Handle.DMA_XferComplete;
    tmp2 = SD_Handle.TransferComplete;
    tmp3 = (SD_Error_t)SD_Handle.TransferError;

    TimeOut = SD_DATATIMEOUT;
    while(((tmp1 & tmp2) == 0) && (tmp3 == SD_OK) && (TimeOut > 0))
    {
        tmp1 = SD_Handle.DMA_XferComplete;
        tmp2 = SD_Handle.TransferComplete;
        tmp3 = (SD_Error_t)SD_Handle.TransferError;
        TimeOut--;
    }

    // Wait until the Rx transfer is no longer active
    TimeOut = SD_DATATIMEOUT;
    while(((SDMMC1->STA & SDMMC_STA_RXACT) != 0) && (TimeOut > 0))
    {
        TimeOut--;
    }

    // Send stop command in multi block read
    if(SD_Handle.Operation == SD_MULTIPLE_BLOCK)
    {
        ErrorState = SD_StopTransfer();
    }

    if((TimeOut == 0) && (ErrorState == SD_OK))
    {
        ErrorState = SD_DATA_TIMEOUT;
    }

    // Clear all the static flags
    SDMMC1->ICR = SDMMC_ICR_STATIC_FLAGS;

    // Return error state
    if(SD_Handle.TransferError != SD_OK)
    {
        return (SD_Error_t)(SD_Handle.TransferError);
    }

    return ErrorState;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  This function waits until the SD DMA data write transfer is finished.
  *         This API should be called after SD_WriteBlocks_DMA() function
  *         to insure that all data sent by the card is already transferred by the
  *         DMA controller.
  * @retval SD Card error state
  */
SD_Error_t SD_CheckWriteOperation(void)
{
    SD_Error_t  ErrorState;
    uint32_t    TimeOut;
    uint32_t    tmp1;
    uint32_t    tmp2;
    SD_Error_t  tmp3;

    // Wait for DMA/SD transfer end or SD error variables to be in SD handle
    tmp1 = SD_Handle.DMA_XferComplete;
    tmp2 = SD_Handle.TransferComplete;
    tmp3 = (SD_Error_t)SD_Handle.TransferError;

    TimeOut = SD_DATATIMEOUT;
    while(((tmp1 & tmp2) == 0) && (tmp3 == SD_OK) && (TimeOut > 0))
    {
        tmp1 = SD_Handle.DMA_XferComplete;
        tmp2 = SD_Handle.TransferComplete;
        tmp3 = (SD_Error_t)SD_Handle.TransferError;
        TimeOut--;
    }

    // Wait until the Tx transfer is no longer active
    TimeOut = SD_DATATIMEOUT;
    while(((SDMMC1->STA & SDMMC_STA_TXACT) != 0) && (TimeOut > 0))
    {
        TimeOut--;
    }

    // Send stop command in multiblock write
    if(SD_Handle.Operation == SD_MULTIPLE_BLOCK)
    {
        ErrorState = SD_StopTransfer();
    }

    if((TimeOut == 0) && (ErrorState == SD_OK))
    {
        ErrorState = SD_DATA_TIMEOUT;
    }

    // Clear all the static flags
    SDMMC1->ICR = SDMMC_ICR_STATIC_FLAGS;

