aroyer-qc/STM32F7_FatFS_HAL_Free/source/FatFs/fatfs_sd_sdio.c
    // Initialize the Data control register
    SDMMC1->DCTRL = 0;

    // Get SCR Register
    if((ErrorState = SD_FindSCR(SD_scr)) != SD_OK)
    {
        return ErrorState;
    }

    // Test the Version supported by the card
    SD_SPEC = (SD_scr[1]  & 0x01000000) | (SD_scr[1]  & 0x02000000);

    if(SD_SPEC != SD_ALLZERO)
    {
        // Set Block Size for Card
        SD_TransmitCommand((SD_CMD_SET_BLOCKLEN | SDMMC_CMD_RESPONSE_SHORT), 64, 1);

        // Check for error conditions
        if((ErrorState = SD_CmdResp1Error( SD_CMD_SET_BLOCKLEN)) != SD_OK)
        {
            return ErrorState;
        }

        // Configure the SD DPSM (Data Path State Machine)
        SD_DataTransferInit(64, SDMMC_DATABLOCK_SIZE_64B, true);

        // Send CMD6 switch mode
        SD_TransmitCommand((SD_CMD_HS_SWITCH | SDMMC_CMD_RESPONSE_SHORT), 0x80FFFF01, 1);

        // Check for error conditions
        if((ErrorState = SD_CmdResp1Error( SD_CMD_HS_SWITCH)) != SD_OK)
        {
            return ErrorState;
        }

        while((SDMMC1->STA & (SDMMC_STA_RXOVERR | SDMMC_STA_DCRCFAIL | SDMMC_STA_DTIMEOUT | SDMMC_STA_DBCKEND)) == 0)
        {
            if((SDMMC1->STA & SDMMC_STA_RXFIFOHF) != 0)
            {
                for(Count = 0; Count < 8; Count++)
                {
                    *(Buffer + Count) = SDMMC1->FIFO;
                }

                Buffer += 8;
            }
        }

        if((SDMMC1->STA & SDMMC_STA_DTIMEOUT) != 0)
        {
            SDMMC1->ICR = SDMMC_ICR_DTIMEOUTC;
            return SD_DATA_TIMEOUT;
        }
        else if((SDMMC1->STA & SDMMC_STA_DCRCFAIL) != 0)
        {
            SDMMC1->ICR = SDMMC_ICR_DCRCFAILC;
            return SD_DATA_CRC_FAIL;
        }
        else if((SDMMC1->STA & SDMMC_STA_RXOVERR) != 0)
        {
            SDMMC1->ICR = SDMMC_ICR_RXOVERRC;
            return SD_RX_OVERRUN;
        }

        Count = SD_DATATIMEOUT;

        while(((SDMMC1->STA & SDMMC_STA_RXDAVL) != 0) && (Count > 0))
        {
            *Buffer = SDMMC1->FIFO;
            Buffer++;
            Count--;
        }

        // Clear all the static flags
        SDMMC1->ICR = SDMMC_ICR_STATIC_FLAGS;

        // Test if the switch mode HS is ok
        if((SD_hs[13] & 2) != 2)
        {
            ErrorState = SD_UNSUPPORTED_FEATURE;
        }
    }

    return ErrorState;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Returns the current SD card's status.
  * @param  pSDstatus: Pointer to the buffer that will contain the SD card status
  * @retval SD Card error state
  */
SD_Error_t HAL_SD_SendSDStatus(uint32_t *pSDstatus)
{
    SD_Error_t ErrorState;
    uint32_t   Count;

    // Check SD response
    if((SDMMC1->RESP1 & SD_CARD_LOCKED) == SD_CARD_LOCKED)
    {
        return SD_LOCK_UNLOCK_FAILED;
    }

    // Set block size for card if it is not equal to current block size for card
     SD_TransmitCommand((SD_CMD_SET_BLOCKLEN | SDMMC_CMD_RESPONSE_SHORT), 64, 1);

    // Check for error conditions
    if((ErrorState = SD_CmdResp1Error( SD_CMD_SET_BLOCKLEN)) != SD_OK)
    {
        return ErrorState;
    }

    // Send CMD55
    SD_TransmitCommand((SD_CMD_APP_CMD | SDMMC_CMD_RESPONSE_SHORT), SD_Handle.RCA << 16, 1);

    // Check for error conditions
    if((ErrorState = SD_CmdResp1Error( SD_CMD_APP_CMD)) != SD_OK)
    {
        return ErrorState;
    }

    // Configure the SD DPSM (Data Path State Machine)
    SD_DataTransferInit(64, SDMMC_DATABLOCK_SIZE_64B, true);

    // Send ACMD13 (SD_APP_STAUS)  with argument as card's RCA
    SD_TransmitCommand((SD_CMD_SD_APP_STATUS | SDMMC_CMD_RESPONSE_SHORT), 0, 1);

    // Check for error conditions
    if((ErrorState = SD_CmdResp1Error( SD_CMD_SD_APP_STATUS)) != SD_OK)
    {
        return ErrorState;
    }

    // Get status data
    while((SDMMC1->STA & (SDMMC_STA_RXOVERR | SDMMC_STA_DCRCFAIL | SDMMC_STA_DTIMEOUT | SDMMC_STA_DBCKEND)) == 0)
    {
        if((SDMMC1->STA & SDMMC_STA_RXFIFOHF) != 0)
        {
            for(Count = 0; Count < 8; Count++)
            {
                *(pSDstatus + Count) = SDMMC1->FIFO;
            }

            pSDstatus += 8;
        }
    }

    if((SDMMC1->STA & SDMMC_STA_DTIMEOUT) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_DTIMEOUTC;
        return SD_DATA_TIMEOUT;
    }
    else if((SDMMC1->STA & SDMMC_STA_DCRCFAIL) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_DCRCFAILC;
        return SD_DATA_CRC_FAIL;
    }
    else if((SDMMC1->STA & SDMMC_STA_RXOVERR) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_RXOVERRC;
        return SD_RX_OVERRUN;
    }

    Count = SD_DATATIMEOUT;
    while(((SDMMC1->STA & SDMMC_STA_RXDAVL) != 0) && (Count > 0))
    {
        *pSDstatus = SDMMC1->FIFO;
        pSDstatus++;
        Count--;
    }

    // Clear all the static status flags
    SDMMC1->ICR = SDMMC_ICR_STATIC_FLAGS;
    return ErrorState;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Gets the current sd card data status.
  * @retval Data Transfer state
  */
SD_Error_t SD_GetStatus(void)
{
    uint32_t       resp1;
    SD_CardState_t CardState;

    resp1     = 0;
    CardState = SD_CARD_TRANSFER;

    // Get SD card state
    if(SD_SendStatus(&resp1) != SD_OK) CardState =  SD_CARD_ERROR;
    else                               CardState = (SD_CardState_t)((resp1 >> 9) & 0x0F);

    // Find SD status according to card state
    if     (CardState == SD_CARD_TRANSFER)  return SD_OK;
    else if(CardState == SD_CARD_ERROR)     return SD_ERROR;
    else                                    return SD_BUSY;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Gets the SD card status.
  * @retval SD Card error state
  */
SD_Error_t SD_GetCardStatus(SD_CardStatus_t* pCardStatus)
{
    SD_Error_t ErrorState;
    uint32_t   tmp = 0;
    uint32_t   SD_Status[16];

    if((ErrorState = SD_SendSDStatus(SD_Status)) != SD_OK)
    {
        return ErrorState;
    }

    // Byte 0
    tmp = (SD_Status[0] & 0xC0) >> 6;
    pCardStatus->DAT_BUS_WIDTH = (uint8_t)tmp;

    // Byte 0
    tmp = (SD_Status[0] & 0x20) >> 5;
    pCardStatus->SECURED_MODE = (uint8_t)tmp;

    // Byte 2
    tmp = (SD_Status[2] & 0xFF);
    pCardStatus->SD_CARD_TYPE = (uint8_t)(tmp << 8);

    // Byte 3
    tmp = (SD_Status[3] & 0xFF);
    pCardStatus->SD_CARD_TYPE |= (uint8_t)tmp;

