aroyer-qc/STM32F7_FatFS_HAL_Free/source/FatFs/fatfs_sd_sdio.c
    // Byte 4
    tmp = (SD_Status[4] & 0xFF);
    pCardStatus->SIZE_OF_PROTECTED_AREA = (uint8_t)(tmp << 24);

    // Byte 5
    tmp = (SD_Status[5] & 0xFF);
    pCardStatus->SIZE_OF_PROTECTED_AREA |= (uint8_t)(tmp << 16);

    // Byte 6
    tmp = (SD_Status[6] & 0xFF);
    pCardStatus->SIZE_OF_PROTECTED_AREA |= (uint8_t)(tmp << 8);

    // Byte 7
    tmp = (SD_Status[7] & 0xFF);
    pCardStatus->SIZE_OF_PROTECTED_AREA |= (uint8_t)tmp;

    // Byte 8
    tmp = (SD_Status[8] & 0xFF);
    pCardStatus->SPEED_CLASS = (uint8_t)tmp;

    // Byte 9
    tmp = (SD_Status[9] & 0xFF);
    pCardStatus->PERFORMANCE_MOVE = (uint8_t)tmp;

    // Byte 10
    tmp = (SD_Status[10] & 0xF0) >> 4;
    pCardStatus->AU_SIZE = (uint8_t)tmp;

    // Byte 11
    tmp = (SD_Status[11] & 0xFF);
    pCardStatus->ERASE_SIZE = (uint8_t)(tmp << 8);

    // Byte 12
    tmp = (SD_Status[12] & 0xFF);
    pCardStatus->ERASE_SIZE |= (uint8_t)tmp;

    // Byte 13
    tmp = (SD_Status[13] & 0xFC) >> 2;
    pCardStatus->ERASE_TIMEOUT = (uint8_t)tmp;

    // Byte 13
    tmp = (SD_Status[13] & 0x3);
    pCardStatus->ERASE_OFFSET = (uint8_t)tmp;

    return SD_OK;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Selects od Deselects the corresponding card.
  * @param  Address: Address of the card to be selected
  * @retval SD Card error state
  */
static SD_Error_t SD_Select_Deselect(uint64_t Address)
{
    // Send CMD7 SDMMC_SEL_DESEL_CARD
    SD_TransmitCommand((SD_CMD_SEL_DESEL_CARD | SDMMC_CMD_RESPONSE_SHORT), (uint32_t)Address, 1);

    // check for error conditions
    return SD_CmdResp1Error( SD_CMD_SEL_DESEL_CARD);
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Enquires cards about their operating voltage and configures clock
  *         controls and stores SD information that will be needed in future
  *         in the SD handle.
  * @retval SD Card error state
  */
static SD_Error_t SD_PowerON(void)
{
    SD_Error_t ErrorState;
    uint32_t response;
    uint32_t Count        = 0;
    uint32_t ValidVoltage = 0;
    uint32_t SD_Type       = SD_STD_CAPACITY;
    uint32_t TickStart;

    // Power ON Sequence -------------------------------------------------------
    SDMMC1->CLKCR &= ~SDMMC_CLKCR_CLKEN;        // Disable SDMMC Clock
    SDMMC1->POWER  = SDMMC_POWER_PWRCTRL;       // Set Power State to ON

    // 1ms: required power up waiting time before starting the SD initialization sequence
    TickStart = Tick;
    while((Tick - TickStart) < 1){}

    SDMMC1->CLKCR |= SDMMC_CLKCR_CLKEN;           // Enable SDMMC Clock

    // CMD0: GO_IDLE_STATE -----------------------------------------------------
    // No CMD response required
    SD_TransmitCommand(SD_CMD_GO_IDLE_STATE, 0, 0);

    // Check for error conditions
    if((ErrorState = SD_CmdError()) != SD_OK)
    {
        // CMD Response Timeout (wait for CMDSENT flag)
        return ErrorState;
    }

    // CMD8: SEND_IF_COND ------------------------------------------------------
    // Send CMD8 to verify SD card interface operating condition
    // Argument: - [31:12]: Reserved (shall be set to '0')
    //- [11:8]: Supply Voltage (VHS) 0x1 (Range: 2.7-3.6 V)
    //- [7:0]: Check Pattern (recommended 0xAA)
    // CMD Response: R7 */
    SD_TransmitCommand((SD_SDMMC_SEND_IF_COND | SDMMC_CMD_RESPONSE_SHORT), SD_CHECK_PATTERN, 7);

    // Check for error conditions
    if((ErrorState = SD_CmdResp7Error()) == SD_OK)
    {
        // SD Card 2.0
        SD_Handle.CardType = STD_CAPACITY_SD_CARD_V2_0;
        SD_Type = SD_HIGH_CAPACITY;
    }

    // Send CMD55
    SD_TransmitCommand((SD_CMD_APP_CMD | SDMMC_CMD_RESPONSE_SHORT), 0, 1);

    // Check for error conditions
    // If ErrorState is Command Timeout, it is a MMC card
    // If ErrorState is SD_OK it is a SD card: SD card 2.0 (voltage range mismatch) or SD card 1.x
    if((ErrorState = SD_CmdResp1Error(SD_CMD_APP_CMD)) == SD_OK)
    {
        // SD CARD
        // Send ACMD41 SD_APP_OP_COND with Argument 0x80100000
        while((!ValidVoltage) && (Count < SD_MAX_VOLT_TRIAL))
        {

            // SEND CMD55 APP_CMD with RCA as 0
            SD_TransmitCommand((SD_CMD_APP_CMD | SDMMC_CMD_RESPONSE_SHORT), 0, 1);

            // Check for error conditions
            if((ErrorState = SD_CmdResp1Error( SD_CMD_APP_CMD)) != SD_OK)
            {
                return ErrorState;
            }

            // Send CMD41
            SD_TransmitCommand((SD_CMD_SD_APP_OP_COND | SDMMC_CMD_RESPONSE_SHORT), SD_VOLTAGE_WINDOW_SD | SD_Type, 3);

            // Check for error conditions
            if((ErrorState = SD_CmdResp3Error()) != SD_OK)
            {
                return ErrorState;
            }

            response = SDMMC1->RESP1;                               // Get command response
            ValidVoltage = (((response >> 31) == 1) ? 1 : 0);       // Get operating voltage
            Count++;
        }

        if(Count >= SD_MAX_VOLT_TRIAL)
        {
            return SD_INVALID_VOLTRANGE;
        }

        if((response & SD_HIGH_CAPACITY) == SD_HIGH_CAPACITY) /* (response &= SD_HIGH_CAPACITY) */
        {
            SD_Handle.CardType = HIGH_CAPACITY_SD_CARD;
        }
    } // else MMC Card

    return ErrorState;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Turns the SDMMC output signals off.
  * @retval SD Card error state
  */
#if 0
static void SD_PowerOFF(void)
{
   // Set Power State to OFF
   SDMMC1->POWER = (uint32_t)0;
}
#endif

/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Returns the current card's status.
  * @param  pCardStatus: pointer to the buffer that will contain the SD card
  *         status (Card Status register)
  * @retval SD Card error state
  */
static SD_Error_t SD_SendStatus(uint32_t *pCardStatus)
{
    SD_Error_t ErrorState;

    // Send Status command
    SD_TransmitCommand((SD_CMD_SEND_STATUS | SDMMC_CMD_RESPONSE_SHORT), SD_Handle.RCA << 16, 1);

    // Check for error conditions
    if((ErrorState = SD_CmdResp1Error(SD_CMD_SEND_STATUS)) == SD_OK)
    {
        *pCardStatus = SDMMC1->RESP1;
    }

    return ErrorState;
}


