aroyer-qc/STM32F7_FatFS_HAL_Free/source/FatFs/fatfs_sd_sdio.c
/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Checks for error conditions for CMD0.
  * @retval SD Card error state
  */
static SD_Error_t SD_CmdError(void)
{
    uint32_t TimeOut;
    uint32_t tmp;

    tmp = SDMMC1->STA & SDMMC_STA_CMDSENT;

    TimeOut = SDMMC_CMD0TIMEOUT;
    while((TimeOut > 0) && (tmp == 0))
    {
        tmp = SDMMC1->STA & SDMMC_STA_CMDSENT;
        TimeOut--;
    }

    if(TimeOut == 0)
    {
        return SD_CMD_RSP_TIMEOUT;
    }

    // Clear all the static flags
    SDMMC1->ICR = SDMMC_ICR_STATIC_FLAGS;
    return SD_OK;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Checks for error conditions for R7 response.
  * @retval SD Card error state
  */
static SD_Error_t SD_CmdResp7Error(void)
{
    uint32_t TimeOut;
    uint32_t tmp;


    tmp = SDMMC1->STA & (SDMMC_STA_CCRCFAIL | SDMMC_STA_CMDREND | SDMMC_STA_CTIMEOUT);

    TimeOut = SDMMC_CMD0TIMEOUT;
    while((tmp == 0) && (TimeOut > 0))
    {
        tmp = SDMMC1->STA & (SDMMC_STA_CCRCFAIL | SDMMC_STA_CMDREND | SDMMC_STA_CTIMEOUT);
        TimeOut--;
    }

    tmp = SDMMC1->STA & SDMMC_STA_CTIMEOUT;

    if((TimeOut == 0) || (tmp != 0))
    {
        // Card is not V2.0 compliant or card does not support the set voltage range
        SDMMC1->ICR = SDMMC_ICR_CTIMEOUTC;
        return SD_CMD_RSP_TIMEOUT;
    }

    if((SDMMC1->STA & SDMMC_STA_CMDREND) != 0)
    {
        // Card is SD V2.0 compliant
        SDMMC1->ICR = SDMMC_ICR_CMDRENDC;
        return SD_OK;
    }

    return SD_ERROR;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Checks for error conditions for R1 response.
  * @param  SD_CMD: The sent command Index
  * @retval SD Card error state
  */
static SD_Error_t SD_CmdResp1Error(uint8_t SD_CMD)
{
    uint32_t response_r1;

    while((SDMMC1->STA & (SDMMC_STA_CCRCFAIL | SDMMC_STA_CMDREND | SDMMC_STA_CTIMEOUT)) == 0){};

    if((SDMMC1->STA & SDMMC_STA_CTIMEOUT) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_CTIMEOUTC;
        return SD_CMD_RSP_TIMEOUT;
    }
    else if((SDMMC1->STA & SDMMC_STA_CCRCFAIL) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_CCRCFAILC;
        return SD_CMD_CRC_FAIL;
    }

    // Check response received is of desired command
    if((uint8_t)SDMMC1->RESPCMD != SD_CMD)
    {
        return SD_ILLEGAL_CMD;
    }

    // Clear all the static flags
    SDMMC1->ICR = SDMMC_ICR_STATIC_FLAGS;

    // We have received response, retrieve it for analysis
    response_r1 = SDMMC1->RESP1;

    if((response_r1 & SD_OCR_ERRORBITS)             == SD_ALLZERO)                      return SD_OK;
    if((response_r1 & SD_OCR_ADDR_OUT_OF_RANGE)     == SD_OCR_ADDR_OUT_OF_RANGE)        return SD_ADDR_OUT_OF_RANGE;
    if((response_r1 & SD_OCR_ADDR_MISALIGNED)       == SD_OCR_ADDR_MISALIGNED)          return SD_ADDR_MISALIGNED;
    if((response_r1 & SD_OCR_BLOCK_LEN_ERR)         == SD_OCR_BLOCK_LEN_ERR)            return SD_BLOCK_LEN_ERR;
    if((response_r1 & SD_OCR_ERASE_SEQ_ERR)         == SD_OCR_ERASE_SEQ_ERR)            return SD_ERASE_SEQ_ERR;
    if((response_r1 & SD_OCR_BAD_ERASE_PARAM)       == SD_OCR_BAD_ERASE_PARAM)          return SD_BAD_ERASE_PARAM;
    if((response_r1 & SD_OCR_WRITE_PROT_VIOLATION)  == SD_OCR_WRITE_PROT_VIOLATION)     return SD_WRITE_PROT_VIOLATION;
    if((response_r1 & SD_OCR_LOCK_UNLOCK_FAILED)    == SD_OCR_LOCK_UNLOCK_FAILED)       return SD_LOCK_UNLOCK_FAILED;
    if((response_r1 & SD_OCR_COM_CRC_FAILED)        == SD_OCR_COM_CRC_FAILED)           return SD_COM_CRC_FAILED;
    if((response_r1 & SD_OCR_ILLEGAL_CMD)           == SD_OCR_ILLEGAL_CMD)              return SD_ILLEGAL_CMD;
    if((response_r1 & SD_OCR_CARD_ECC_FAILED)       == SD_OCR_CARD_ECC_FAILED)          return SD_CARD_ECC_FAILED;
    if((response_r1 & SD_OCR_CC_ERROR)              == SD_OCR_CC_ERROR)                 return SD_CC_ERROR;
    if((response_r1 & SD_OCR_GENERAL_UNKNOWN_ERROR) == SD_OCR_GENERAL_UNKNOWN_ERROR)    return SD_GENERAL_UNKNOWN_ERROR;
    if((response_r1 & SD_OCR_STREAM_READ_UNDERRUN)  == SD_OCR_STREAM_READ_UNDERRUN)     return SD_STREAM_READ_UNDERRUN;
    if((response_r1 & SD_OCR_STREAM_WRITE_OVERRUN)  == SD_OCR_STREAM_WRITE_OVERRUN)     return SD_STREAM_WRITE_OVERRUN;
    if((response_r1 & SD_OCR_CID_CSD_OVERWRITE)     == SD_OCR_CID_CSD_OVERWRITE)        return SD_CID_CSD_OVERWRITE;
    if((response_r1 & SD_OCR_WP_ERASE_SKIP)         == SD_OCR_WP_ERASE_SKIP)            return SD_WP_ERASE_SKIP;
    if((response_r1 & SD_OCR_CARD_ECC_DISABLED)     == SD_OCR_CARD_ECC_DISABLED)        return SD_CARD_ECC_DISABLED;
    if((response_r1 & SD_OCR_ERASE_RESET)           == SD_OCR_ERASE_RESET)              return SD_ERASE_RESET;
    if((response_r1 & SD_OCR_AKE_SEQ_ERROR)         == SD_OCR_AKE_SEQ_ERROR)            return SD_AKE_SEQ_ERROR;
    return SD_OK;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Checks for error conditions for R3 (OCR) response.
  * @retval SD Card error state
  */
static SD_Error_t SD_CmdResp3Error(void)
{
    SD_Error_t ErrorState = SD_OK;

    while((SDMMC1->STA & (SDMMC_STA_CCRCFAIL | SDMMC_STA_CMDREND | SDMMC_STA_CTIMEOUT)) == 0){};

    if((SDMMC1->STA & SDMMC_STA_CTIMEOUT) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_CTIMEOUTC;
        return SD_CMD_RSP_TIMEOUT;
    }

    // Clear all the static flags
    SDMMC1->ICR = SDMMC_ICR_STATIC_FLAGS;
    return ErrorState;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Checks for error conditions for R2 (CID or CSD) response.
  * @retval SD Card error state
  */
static SD_Error_t SD_CmdResp2Error(void)
{
    SD_Error_t ErrorState = SD_OK;

