aroyer-qc/STM32F7_FatFS_HAL_Free/source/FatFs/fatfs_sd_sdio.c
    while((SDMMC1->STA & (SDMMC_STA_CCRCFAIL | SDMMC_STA_CMDREND | SDMMC_STA_CTIMEOUT)) == 0){};

    if((SDMMC1->STA & SDMMC_STA_CTIMEOUT) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_CTIMEOUTC;
        return SD_CMD_RSP_TIMEOUT;
    }
    else if((SDMMC1->STA & SDMMC_STA_CCRCFAIL) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_CCRCFAILC;
        return SD_CMD_CRC_FAIL;
    }
    // Clear all the static flags
    SDMMC1->ICR = SDMMC_ICR_STATIC_FLAGS;
    return ErrorState;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Checks for error conditions for R6 (RCA) response.
  * @param  SD_CMD: The sent command Index
  * @param  pRCA: Pointer to the variable that will contain the SD card relative
  *         address RCA
  * @retval SD Card error state
  */
static SD_Error_t SD_CmdResp6Error(uint8_t SD_CMD, uint16_t *pRCA)
{
    SD_Error_t ErrorState = SD_OK;
    uint32_t response_r1;

    while((SDMMC1->STA & (SDMMC_STA_CCRCFAIL | SDMMC_STA_CMDREND | SDMMC_STA_CTIMEOUT)) == 0){};

    if((SDMMC1->STA & SDMMC_STA_CTIMEOUT) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_CTIMEOUTC;
        return SD_CMD_RSP_TIMEOUT;
    }
    else if((SDMMC1->STA & SDMMC_STA_CCRCFAIL) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_CCRCFAILC;
        return SD_CMD_CRC_FAIL;
    }

    // Check response received is of desired command
    if((uint8_t)SDMMC1->RESPCMD != SD_CMD)
    {
        return SD_ILLEGAL_CMD;
    }

    SDMMC1->ICR = SDMMC_ICR_STATIC_FLAGS;       // Clear all the static flags
    response_r1 = SDMMC1->RESP1;                // We have received response, retrieve it.

    if((response_r1 & (SD_R6_GENERAL_UNKNOWN_ERROR | SD_R6_ILLEGAL_CMD | SD_R6_COM_CRC_FAILED)) == SD_ALLZERO)
    {
        *pRCA = (uint16_t) (response_r1 >> 16);
        return ErrorState;
    }

    if((response_r1 & SD_R6_GENERAL_UNKNOWN_ERROR) == SD_R6_GENERAL_UNKNOWN_ERROR)  return SD_GENERAL_UNKNOWN_ERROR;
    if((response_r1 & SD_R6_ILLEGAL_CMD) == SD_R6_ILLEGAL_CMD)                      return SD_ILLEGAL_CMD;
    if((response_r1 & SD_R6_COM_CRC_FAILED) == SD_R6_COM_CRC_FAILED)                return SD_COM_CRC_FAILED;
    return ErrorState;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Enables the SDMMC wide bus mode.
  * @retval SD Card error state
  */
static SD_Error_t SD_WideBusEnable(void)
{
    SD_Error_t ErrorState = SD_OK;
    uint32_t scr[2] = {0, 0};

    if((SDMMC1->RESP1 & SD_CARD_LOCKED) == SD_CARD_LOCKED)
    {
        return SD_LOCK_UNLOCK_FAILED;
    }

    // Get SCR Register
    if((ErrorState = SD_FindSCR(scr)) != SD_OK)
    {
        return ErrorState;
    }

    // If requested card supports wide bus operation
    if((scr[1] & SD_WIDE_BUS_SUPPORT) != SD_ALLZERO)
    {
        // Send CMD55 APP_CMD with argument as card's RCA.
        SD_TransmitCommand((SD_CMD_APP_CMD | SDMMC_CMD_RESPONSE_SHORT), SD_Handle.RCA << 16, 1);
        // Check for error conditions
        if((ErrorState = SD_CmdResp1Error(SD_CMD_APP_CMD)) != SD_OK)
        {
            return ErrorState;
        }

        // Send ACMD6 APP_CMD with argument as 2 for wide bus mode
        SD_TransmitCommand((SD_CMD_APP_SD_SET_BUSWIDTH | SDMMC_CMD_RESPONSE_SHORT), 2, 1);

        // Check for error conditions
        ErrorState = SD_CmdResp1Error(SD_CMD_APP_SD_SET_BUSWIDTH);
        return ErrorState;
    }
    else
    {
        ErrorState = SD_REQUEST_NOT_APPLICABLE;
        return ErrorState;
    }
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Disables the SDMMC wide bus mode.
  * @retval SD Card error state
  */
static SD_Error_t SD_WideBusDisable(void)
{
    SD_Error_t ErrorState = SD_OK;
    uint32_t scr[2] = {0, 0};

    if((SDMMC1->RESP1 & SD_CARD_LOCKED) == SD_CARD_LOCKED)
    {
        return SD_LOCK_UNLOCK_FAILED;
    }

    // Get SCR Register
    if((ErrorState = SD_FindSCR(scr)) != SD_OK)
    {
        return ErrorState;
    }

    // If requested card supports 1 bit mode operation
    if((scr[1] & SD_SINGLE_BUS_SUPPORT) != SD_ALLZERO)
    {
        // Send CMD55 APP_CMD with argument as card's RCA
        SD_TransmitCommand((SD_CMD_APP_CMD | SDMMC_CMD_RESPONSE_SHORT), SD_Handle.RCA << 16, 1);

        // Check for error conditions
        if((ErrorState = SD_CmdResp1Error(SD_CMD_APP_CMD)) != SD_OK)
        {
            return ErrorState;
        }

        // Send ACMD6 APP_CMD with argument as 0 for single bus mode
        SD_TransmitCommand((SD_CMD_APP_SD_SET_BUSWIDTH | SDMMC_CMD_RESPONSE_SHORT), 0, 1);

        // Check for error conditions
        return SD_CmdResp1Error( SD_CMD_APP_SD_SET_BUSWIDTH);;
    }
    else
    {
        return SD_REQUEST_NOT_APPLICABLE;
    }
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  Finds the SD card SCR register value.
  * @param  pSCR: pointer to the buffer that will contain the SCR value
  * @retval SD Card error state
  */
static SD_Error_t SD_FindSCR(uint32_t *pSCR)
{
    SD_Error_t ErrorState;
    uint32_t Index = 0;
    uint32_t tempscr[2] = {0, 0};

    // Set Block Size To 8 Bytes
    // Send CMD55 APP_CMD with argument as card's RCA
    SD_TransmitCommand((SD_CMD_SET_BLOCKLEN | SDMMC_CMD_RESPONSE_SHORT), 8, 1);

    // Check for error conditions
    if((ErrorState = SD_CmdResp1Error(SD_CMD_SET_BLOCKLEN)) != SD_OK)
    {
        return ErrorState;
    }

    // Send CMD55 APP_CMD with argument as card's RCA
    SD_TransmitCommand((SD_CMD_APP_CMD | SDMMC_CMD_RESPONSE_SHORT), SD_Handle.RCA << 16, 1);

    // Check for error conditions
    if((ErrorState = SD_CmdResp1Error(SD_CMD_APP_CMD)) != SD_OK)
    {
        return ErrorState;
    }

    SD_DataTransferInit(8, SDMMC_DATABLOCK_SIZE_8B, true);

