aroyer-qc/STM32F7_FatFS_HAL_Free/source/FatFs/fatfs_sd_sdio.c
/** -----------------------------------------------------------------------------------------------------------------*/
DSTATUS FATFS_SD_disk_initialize(void)
{
	SD_Error_t ErrorState;

	// Check if SD card is present
	if(SD_IsDetected() != SD_PRESENT)
    {
        return MSD_ERROR_SD_NOT_PRESENT;
    }

    // Initialize SDMMC peripheral interface with default configuration for SD card initialization
    SDMMC1->CLKCR &= ~(uint32_t)CLKCR_CLEAR_MASK;
    SDMMC1->CLKCR |=  (uint32_t)SDMMC_INIT_CLK_DIV;

    if((ErrorState = SD_PowerON()) == SD_OK)                    // Identify card operating voltage
    {
        if((ErrorState = SD_InitializeCard()) == SD_OK)          // Initialize the present card and put them in idle state
        {
            if((ErrorState = SD_GetCardInfo()) == SD_OK)        // Read CSD/CID MSD registers
            {                                                   // Select the Card
                ErrorState = SD_Select_Deselect((uint32_t)(((uint32_t)SD_CardInfo.RCA) << 16));
                SDMMC1->CLKCR &= ~(uint32_t)CLKCR_CLEAR_MASK;   // Configure SDMMC peripheral interface
            }
        }
    }

	// Configure SD Bus width
	if(ErrorState == SD_OK)
	{
		// Enable wide operation
		ErrorState = SD_WideBusOperationConfig(SDMMC_BUS_WIDE_4B);
	}

	// Configure the SDCARD device
	Status = STA_NOINIT;
	if(ErrorState == SD_OK)
    {
        Status &= ~STA_NOINIT;
    }

	return Status;
}


/** -----------------------------------------------------------------------------------------------------------------*/
DSTATUS FATFS_SD_disk_status(void)
{
	Status = STA_NOINIT;

	// Check SDCARD status
	if(SD_GetStatus() == SD_OK) Status &= ~STA_NOINIT;
	else                        Status |= STA_NOINIT;

	return Status;
}


/** -----------------------------------------------------------------------------------------------------------------*/
DRESULT FATFS_SD_disk_ioctl(BYTE cmd, void *buff)
{
	DRESULT Result = RES_ERROR;

	// Check if init OK
	if(Status & STA_NOINIT) return RES_NOTRDY;

	switch(cmd)
	{
		// Make sure that no pending write process
		case CTRL_SYNC:
        {
			Result = RES_OK;
			break;
        }

		// Get number of sectors on the disk (DWORD)
		case GET_SECTOR_COUNT:
        {
			SD_GetCardInfo();
			*(DWORD *)buff = SD_CardInfo.CardCapacity / BLOCK_SIZE;
			Result = RES_OK;
			break;
        }

		// Get R/W sector size (WORD)
		case GET_SECTOR_SIZE:
        {
			*(WORD *)buff = BLOCK_SIZE;
			Result = RES_OK;
			break;
        }

		// Get erase block size in unit of sector (DWORD)
		case GET_BLOCK_SIZE:
        {
			*(DWORD*)buff = BLOCK_SIZE;
			break;
        }

		default:
        {
			Result = RES_PARERR;
        }
	}

	return Result;
}


/** -----------------------------------------------------------------------------------------------------------------*/
DRESULT FATFS_SD_disk_read(BYTE *buff, DWORD sector, UINT Count)
{
	// Read block(s) in DMA transfer mode
	if(SD_ReadBlocks_DMA((uint32_t *)buff, (uint64_t) (sector * BLOCK_SIZE), BLOCK_SIZE, Count) == SD_OK)
    {
        // Wait until transfer is complete
		if(SD_CheckReadOperation() == SD_OK)
        {
            return RES_OK;
        }
    }

	return RES_ERROR;
}


/** -----------------------------------------------------------------------------------------------------------------*/
DRESULT FATFS_SD_disk_write(const BYTE *buff, DWORD sector, UINT Count)
{
	// Write block(s) in DMA transfer mode
	if(SD_WriteBlocks_DMA((uint32_t *)buff, (sector * BLOCK_SIZE), BLOCK_SIZE, Count) == SD_OK)
    {
        // Wait until transfer is complete
		if(SD_CheckWriteOperation() == SD_OK)
        {
            return RES_OK;
        }
    }

	return RES_ERROR;
}


/** -----------------------------------------------------------------------------------------------------------------*/
FRESULT FATFS_GetDriveSize(char* pStr, FATFS_Size_t* SizeStruct)
{
	FATFS*  pFS;
    DWORD   FreeCluster;
	FRESULT Result;

    // Get volume information and free clusters of drive
    if((Result = f_getfree(pStr, &FreeCluster, &pFS)) == FR_OK)
    {
        // Get total sectors and free sectors
        SizeStruct->Total = (pFS->n_fatent - 2) * pFS->csize * 0.5;
        SizeStruct->Free = FreeCluster * pFS->csize * 0.5;
    }

    return Result;
}


/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  This function handles SD card interrupt request.
  */
void SDMMC1_IRQHandler(void)
{
    // Check for SDMMC interrupt flags
    if((SDMMC1->STA & SDMMC_STA_DATAEND) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_DATAENDC;
        SD_Handle.TransferComplete = 1;           // SD transfer is complete
        SD_Handle.TransferError  = SD_OK;       // No transfer error
    }
    else if((SDMMC1->STA & SDMMC_STA_DCRCFAIL) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_DCRCFAILC;
        SD_Handle.TransferError = SD_DATA_CRC_FAIL;
    }
    else if((SDMMC1->STA & SDMMC_STA_DTIMEOUT) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_DTIMEOUTC;
        SD_Handle.TransferError = SD_DATA_TIMEOUT;
    }
    else if((SDMMC1->STA & SDMMC_STA_RXOVERR) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_RXOVERRC;
        SD_Handle.TransferError = SD_RX_OVERRUN;
    }
    else if((SDMMC1->STA & SDMMC_STA_TXUNDERR) != 0)
    {
        SDMMC1->ICR = SDMMC_ICR_TXUNDERRC;
        SD_Handle.TransferError = SD_TX_UNDERRUN;
    }

    // Disable all SDMMC peripheral interrupt sources
    SDMMC1->MASK &= ~(SDMMC_MASK_DCRCFAILIE | SDMMC_MASK_DTIMEOUTIE | SDMMC_MASK_DATAENDIE  |
                      SDMMC_MASK_TXFIFOHEIE | SDMMC_MASK_RXFIFOHFIE | SDMMC_MASK_TXUNDERRIE |
                      SDMMC_MASK_RXOVERRIE);
}

/** -----------------------------------------------------------------------------------------------------------------*/
/**
  * @brief  This function handles DMA2 Stream 3 interrupt request.
  */
void DMA2_Stream3_IRQHandler(void)
{
    // Transfer Error Interrupt management
    if((DMA2->LISR & DMA_LISR_TEIF3) != 0)
    {
        if((DMA2_Stream3->CR & DMA_SxCR_TEIE) != 0)
        {
            DMA2_Stream3->CR   &= ~DMA_SxCR_TEIE;       // Disable the transfer error interrupt
            DMA2->LIFCR = DMA_LIFCR_CTEIF3;             // Clear the transfer error flag
        }
    }

    // FIFO Error Interrupt management
    if((DMA2->LISR & DMA_LISR_FEIF3) != 0)
    {
        if((DMA2_Stream3->FCR & DMA_SxFCR_FEIE) != 0)
        {
            DMA2_Stream3->FCR   &= ~DMA_SxFCR_FEIE;     // Disable the FIFO Error interrupt
            DMA2->LIFCR = DMA_LIFCR_CFEIF3;             // Clear the FIFO error flag
        }
    }

